//  Helllo World হচ্ছে প্রোগ্রামার দের লাইফে লেখা প্রথম কোড
//      প্রথমে একটি খালি ফাইল নিয়ে সেইটা ডট সি (.c) এক্সটেনশন দিয়ে সেভ করে তারপর ফাইল এ কোড লিখতে হয়।
//      ডট সি এক্সটেনশন দিয়ে সেভ না করলে ফাইল টা রান করবে নাহ ।
//      তারপর বিল্ড এন্ড রান করলে ফাইল টা ব্ল্যাক স্ক্রীনে দেখাবে।
//      আমাদের প্রথম কোড টা লিখে ফেলি চলো।
#include<stdio.h> //একে বলা হয় হেডার ফাইল। এইখানে include করতে বলা হয়েছে std=(Standard input output) .h= (header file)কে।
int main()  //এইটা হচ্ছে আমাদের মেইন ফাংশন।মেইন ফাংশন থেকে কোড গুলা রান করে।এরপর সেকেন্ড ব্র্যাকেট এর ভিতর আমাদের কোড গুলা লিখে ফেলবো।
{
    printf("Hello World"); //printf() এইটা হচ্ছে প্রিন্ট ফাংশন।এর মাধ্যমে যেকোন লেখা/কাজ ব্ল্যাক স্ক্রীনে প্রিন্ট করা হয়।সব কোড শেষে সেমিকোলন দিতেই হবে।এটি একটি স্টেটমেন্ট বলা হয়।
    return 0; //যেহেতু মেইন ফাংশন কোন কিছু রিটার্ন করছে না তাই ০ দিতে হবে। এটি একটি স্টেটমেন্ট বলা হয়।
}
