//  Operator ব্যবহার করা হয় কোন  ভ্যালুর মান ভ্যারিয়েবল এর মধ্যে রাখার জন্য।
//          সবচেয়ে বেশি ব্যবহার করা হয় = (Equal To) সাইন।আরো কিছু  Assingment Operator হচ্ছেঃ
//  Plus Equal To (+=)
//  Minus Equal To (-=)
//  Product Equal To (*=)
//  Division Equal To (/=)

#include<stdio.h>
int main()
{
    int x =5,y=10,a=12,b=8,c=5,d=6,e=12,f=4;
    float z = 3.1415;

    x+=y;       //এইখানে x এর ভ্যালু এর সাথে y এর ভ্যালু এড করে x এর ভিতর আবার এসাইন করে রাখা হয়েছে। x = x+y এই রকম অনেকটা।
    printf("%d\n",x); // ভ্যালু হবে ১৫।

    a-=b;       //এইখানে a ভ্যালু থেকে  b বাদ দিয়ে  আবার a এর ভিতর আবার এসাইন করে রাখা হয়েছে। a = a-b এই রকম অনেকটা।
    printf("%d\n",a); // ভ্যালু হবে  4 ।

    c*=d;        //এইখানে c এর সাথে d গুন দিয়ে আবার c এর ভিতর আবার এসাইন করে রাখা হয়েছে। c = c*d এই রকম অনেকটা।
    printf("%d\n",c); //ভ্যালু হবে ৩০।

    e/=f;       //এইখানে e এর ভ্যালুকে f দিয়ে ভাগ দিয়ে e এর ভিতর আবার এসাইন করে রাখা হয়েছে। e = e/f এই রকম অনেকটা।
    printf("%d\n",e); //ভ্যালু হবে ৩।


    //Arithmatic operator  গুলো হছে যোগ,বিয়োগ,গুন,ভাগ,ভাগশেষ।
    // +,-,*,/,%
    // % কে মডুলাস অপারেটর বলা হয়। এইটা ভাগশেষ এর কাজ করে।
    // মডুলাস অপারেটর সব সময় পজেটিভ ইন্টিজার হবে।

    int value1=14,value2=3;
    printf("%d\n",value1%value2);


}
